app/views/projects/index.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 1]]
---
      <div class="headtasklist">
          <% f.tasks.each do |fff| %>