app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Test project"], ["created_at", "2019-09-10 20:30:31.782428"], ["updated_at", "2019-09-10 20:30:31.782428"]]
---
  def create
    @project = Project.new(project_params)

    if @project.save

SELECT * FROM "projects" WHERE ("projects"."id" = '6') LIMIT 1
---
  def edit
    @project = Project.find(params[:id])

SELECT * FROM "projects" WHERE ("projects"."id" = '6') LIMIT 1
---
  def update
    @project = Project.find(params[:id])

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 2]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    Project.find(params[:id]).destroy