app/controllers/tasks_controller.rb

  def create
    Task.create(task_params)
---
INSERT INTO "tasks" ("name", "project_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Task 1"], ["project_id", 1], ["status", 0], ["created_at", "2019-09-10 20:45:20.216658"], ["updated_at", "2019-09-10 20:45:20.216658"]]

  def update
    @task = Task.find(params[:id])

    if @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["name", "Name"], ["updated_at", "2019-09-10 20:45:50.312259"], ["id", 2]]

  def destroy
    Task.find(params[:id]).destroy
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]